#include <stdio.h>
int main() {
    int a,b,c;
    printf("q1你更喜欢哪种天气?\n1. 阴天，有点冷最好\n2. 大太阳，越热越好\n请输入选项（1或2）：");
    scanf("%d", &a);
    printf("问题2：朋友眼中的你更像？\n1. 安静、温柔的人\n2. 热情、冲动的人\n请输入选项（1或2）：");
    scanf("%d", &b);    
    printf("问题3：你面对压力时的表现是？\n1. 冷静分析，慢慢解决\n2. 当场爆发，情绪上头\n请输入选项（1或2）：");
    scanf("%d", &c);
    int sum = a + b + c;
    if (sum <= 3) {
        printf("你是【冬日冻豆腐】！总是安安静静，却能在关键时刻吸收一切，释放力量。\n");
    } else if (sum <= 5) {
        printf("辣牛肉片：热情直接，喜欢挑战，火锅界的战士。\n");
    } else {
        printf("毛肚：冲动易燃，情绪上头三秒钟，性格跳跃。\n");
    }
    return 0;
}